// 构造测试数据
using NPOI.Demo;

Dictionary<string, object> content = new Dictionary<string, object>
{
    ["生产数据"] = new List<object>
    {
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 9:46:10",
            ["玻璃编码"] = "ZNJ1202601310053",
            ["龙门左轴-速度"] = 0.0194,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.00005,  // 这里会测试到 5E-5 的显示问题
            ["龙门右轴-位置"] = 0.0000013,
            ["模头左轴-速度"] = 9.9034,
            ["模头左轴-位置"] = 15.7177,
            ["模头右轴-速度"] = 10.0153,
            ["模头右轴-位置"] = 16.1844
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 9:47:30",
            ["玻璃编码"] = "ZNJ1202601310053",
            ["龙门左轴-速度"] = 196.282,
            ["龙门左轴-位置"] = 155.701,
            ["龙门右轴-速度"] = 196.32,
            ["龙门右轴-位置"] = 188.544,
            ["模头左轴-速度"] = 0.00215,
            ["模头左轴-位置"] = 48.0002,
            ["模头右轴-速度"] = 0.0024,
            ["模头右轴-位置"] = 48.0004
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 10:59:52",
            ["玻璃编码"] = "ZNJ1202602030021",
            ["龙门左轴-速度"] = 0.06995,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.05090,
            ["龙门右轴-位置"] = 228.824,
            ["模头左轴-速度"] = 9.70475,
            ["模头左轴-位置"] = 47.5778,
            ["模头右轴-速度"] = 4.4389,
            ["模头右轴-位置"] = 47.9194
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 11:02:33",
            ["玻璃编码"] = "ZNJ1202602030022",
            ["龙门左轴-速度"] = 0.0633,
            ["龙门左轴-位置"] = 195.999,
            ["龙门右轴-速度"] = 0.02025,
            ["龙门右轴-位置"] = 228.824,
            ["模头左轴-速度"] = 9.95315,
            ["模头左轴-位置"] = 40.7375,
            ["模头右轴-速度"] = 9.98915,
            ["模头右轴-位置"] = 41.2044
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 11:05:14",
            ["玻璃编码"] = "ZNJ1202602030023",
            ["龙门左轴-速度"] = 0.04535,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.08540,
            ["龙门右轴-位置"] = 228.825,
            ["模头左轴-速度"] = 9.9419,
            ["模头左轴-位置"] = 37.2178,
            ["模头右轴-速度"] = 10.001,
            ["模头右轴-位置"] = 37.685
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 11:07:54",
            ["玻璃编码"] = "ZNJ1202602030024",
            ["龙门左轴-速度"] = 0.01625,
            ["龙门左轴-位置"] = -69.7215,
            ["龙门右轴-速度"] = 0.04725,
            ["龙门右轴-位置"] = -36.9006,
            ["模头左轴-速度"] = 0.00225,
            ["模头左轴-位置"] = 48.0,
            ["模头右轴-速度"] = 0.0038,
            ["模头右轴-位置"] = 48.0
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 11:10:35",
            ["玻璃编码"] = "ZNJ1202602030025",
            ["龙门左轴-速度"] = 0.03935,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.07975,
            ["龙门右轴-位置"] = 228.825,
            ["模头左轴-速度"] = 9.99425,
            ["模头左轴-位置"] = 28.2773,
            ["模头右轴-速度"] = 9.9805,
            ["模头右轴-位置"] = 28.7452
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 11:13:16",
            ["玻璃编码"] = "ZNJ1202602030026",
            ["龙门左轴-速度"] = 0.0069,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.00015,
            ["龙门右轴-位置"] = 228.824,
            ["模头左轴-速度"] = 10.0279,
            ["模头左轴-位置"] = 23.3176,
            ["模头右轴-速度"] = 9.9698,
            ["模头右轴-位置"] = 23.7855
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 11:16:57",
            ["玻璃编码"] = "ZNJ1202602030027",
            ["龙门左轴-速度"] = 0.01795,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.033,
            ["龙门右轴-位置"] = 228.825,
            ["模头左轴-速度"] = 4.94205,
            ["模头左轴-位置"] = 14.3147,
            ["模头右轴-速度"] = 5.01575,
            ["模头右轴-位置"] = 14.5501
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 11:52:07",
            ["玻璃编码"] = "ZNJ1202602030036",
            ["龙门左轴-速度"] = 0.0617,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.127,
            ["龙门右轴-位置"] = 228.825,
            ["模头左轴-速度"] = 10.0773,
            ["模头左轴-位置"] = 40.019,
            ["模头右轴-速度"] = 9.99525,
            ["模头右轴-位置"] = 40.4842
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 11:54:48",
            ["玻璃编码"] = "ZNJ1202602030037",
            ["龙门左轴-速度"] = 0.0504,
            ["龙门左轴-位置"] = 196.001,
            ["龙门右轴-速度"] = 0.0419,
            ["龙门右轴-位置"] = 228.826,
            ["模头左轴-速度"] = 10.0033,
            ["模头左轴-位置"] = 30.7972,
            ["模头右轴-速度"] = 9.98725,
            ["模头右轴-位置"] = 31.2638
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 11:57:30",
            ["玻璃编码"] = "ZNJ1202602030038",
            ["龙门左轴-速度"] = 0.0371,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.05195,
            ["龙门右轴-位置"] = 228.824,
            ["模头左轴-速度"] = 10.0635,
            ["模头左轴-位置"] = 21.4785,
            ["模头右轴-速度"] = 9.98565,
            ["模头右轴-位置"] = 21.9429
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 12:00:11",
            ["玻璃编码"] = "ZNJ1202602030039",
            ["龙门左轴-速度"] = 0.07005,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.0751,
            ["龙门右轴-位置"] = 228.824,
            ["模头左轴-速度"] = 4.98865,
            ["模头左轴-位置"] = 14.6765,
            ["模头右轴-速度"] = 3.98905,
            ["模头右轴-位置"] = 14.8965
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 12:02:52",
            ["玻璃编码"] = "ZNJ1202602030040",
            ["龙门左轴-速度"] = 0.02705,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.0,
            ["龙门右轴-位置"] = 228.824,
            ["模头左轴-速度"] = 5.00305,
            ["模头左轴-位置"] = 10.874,
            ["模头右轴-速度"] = 4.99465,
            ["模头右轴-位置"] = 11.1082
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 12:17:56",
            ["玻璃编码"] = "ZNJ1202602030045",
            ["龙门左轴-速度"] = 0.0115,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.0285,
            ["龙门右轴-位置"] = 228.824,
            ["模头左轴-速度"] = 5.8993,
            ["模头左轴-位置"] = 15.1223,
            ["模头右轴-速度"] = 9.814,
            ["模头右轴-位置"] = 15.5253
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 12:20:37",
            ["玻璃编码"] = "ZNJ1202602030046",
            ["龙门左轴-速度"] = 0.0668,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.062,
            ["龙门右轴-位置"] = 228.825,
            ["模头左轴-速度"] = 4.96855,
            ["模头左轴-位置"] = 12.785,
            ["模头右轴-速度"] = 5.0193,
            ["模头右轴-位置"] = 13.0192
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 13:25:06",
            ["玻璃编码"] = "ZNJ1202602030051",
            ["龙门左轴-速度"] = 0.04925,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.06,
            ["龙门右轴-位置"] = 228.826,
            ["模头左轴-速度"] = 10.0109,
            ["模头左轴-位置"] = 39.0382,
            ["模头右轴-速度"] = 10.0268,
            ["模头右轴-位置"] = 39.5049
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 13:29:28",
            ["玻璃编码"] = "ZNJ1202602030053",
            ["龙门左轴-速度"] = 0.03,
            ["龙门左轴-位置"] = 195.999,
            ["龙门右轴-速度"] = 0.00000013,
            ["龙门右轴-位置"] = 228.825,
            ["模头左轴-速度"] = 0.00365,
            ["模头左轴-位置"] = 47.9998,
            ["模头右轴-速度"] = 0.0045,
            ["模头右轴-位置"] = 47.9996
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 13:32:09",
            ["玻璃编码"] = "ZNJ1202602030054",
            ["龙门左轴-速度"] = 0.00325,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.04285,
            ["龙门右轴-位置"] = 228.825,
            ["模头左轴-速度"] = 10.0524,
            ["模头左轴-位置"] = 42.9981,
            ["模头右轴-速度"] = 9.9883,
            ["模头右轴-位置"] = 43.4638
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 13:34:49",
            ["玻璃编码"] = "ZNJ1202602030055",
            ["龙门左轴-速度"] = 0.02525,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.0459,
            ["龙门右轴-位置"] = 228.826,
            ["模头左轴-速度"] = 10.0531,
            ["模头左轴-位置"] = 38.8173,
            ["模头右轴-速度"] = 10.0232,
            ["模头右轴-位置"] = 39.285
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 13:38:40",
            ["玻璃编码"] = "ZNJ1202602030056",
            ["龙门左轴-速度"] = 0.0011,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.0019,
            ["龙门右轴-位置"] = 228.825,
            ["模头左轴-速度"] = 5.04275,
            ["模头左轴-位置"] = 11.9545,
            ["模头右轴-速度"] = 4.99605,
            ["模头右轴-位置"] = 12.1909
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 13:41:18",
            ["玻璃编码"] = "ZNJ1202602030057",
            ["龙门左轴-速度"] = 0.04375,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.10575,
            ["龙门右轴-位置"] = 228.825,
            ["模头左轴-速度"] = 10.021,
            ["模头左轴-位置"] = 30.5186,
            ["模头右轴-速度"] = 9.99515,
            ["模头右轴-位置"] = 30.984
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 13:43:59",
            ["玻璃编码"] = "ZNJ1202602030058",
            ["龙门左轴-速度"] = 0.0508,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.03615,
            ["龙门右轴-位置"] = 228.825,
            ["模头左轴-速度"] = 10.0687,
            ["模头左轴-位置"] = 24.8569,
            ["模头右轴-速度"] = 9.9593,
            ["模头右轴-位置"] = 25.3247
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 13:46:40",
            ["玻璃编码"] = "ZNJ1202602030059",
            ["龙门左轴-速度"] = 0.0835,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.0836,
            ["龙门右轴-位置"] = 228.825,
            ["模头左轴-速度"] = 10.0714,
            ["模头左轴-位置"] = 19.4788,
            ["模头右轴-速度"] = 9.9619,
            ["模头右轴-位置"] = 19.9442
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 13:49:22",
            ["玻璃编码"] = "ZNJ1202602030060",
            ["龙门左轴-速度"] = 0.038,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.05375,
            ["龙门右轴-位置"] = 228.825,
            ["模头左轴-速度"] = 5.075,
            ["模头左轴-位置"] = 9.49575,
            ["模头右轴-速度"] = 4.999,
            ["模头右轴-位置"] = 9.7299
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 14:45:59",
            ["玻璃编码"] = "ZNJ1202602030070",
            ["龙门左轴-速度"] = 0.0296,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.0006,
            ["龙门右轴-位置"] = 228.825,
            ["模头左轴-速度"] = 9.98525,
            ["模头左轴-位置"] = 18.5586,
            ["模头右轴-速度"] = 10.0087,
            ["模头右轴-位置"] = 19.0254
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 14:48:50",
            ["玻璃编码"] = "ZNJ1202602030071",
            ["龙门左轴-速度"] = 0.0811,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.1006,
            ["龙门右轴-位置"] = 228.826,
            ["模头左轴-速度"] = 10.0836,
            ["模头左轴-位置"] = 33.3578,
            ["模头右轴-速度"] = 9.94165,
            ["模头右轴-位置"] = 33.8253
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 15:47:48",
            ["玻璃编码"] = "ZNJ1202602030078",
            ["龙门左轴-速度"] = 0.07925,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.07085,
            ["龙门右轴-位置"] = 228.826,
            ["模头左轴-速度"] = 10.0813,
            ["模头左轴-位置"] = 29.918,
            ["模头右轴-速度"] = 9.9793,
            ["模头右轴-位置"] = 30.3847
        },
        new Dictionary<string, object>
        {
            ["创建时间"] = "2026/2/3 15:50:29",
            ["玻璃编码"] = "ZNJ1202601310045",
            ["龙门左轴-速度"] = 0.0437,
            ["龙门左轴-位置"] = 196.0,
            ["龙门右轴-速度"] = 0.0656,
            ["龙门右轴-位置"] = 228.826,
            ["模头左轴-速度"] = 9.88965,
            ["模头左轴-位置"] = 20.1383,
            ["模头右轴-速度"] = 10.045,
            ["模头右轴-位置"] = 20.6116
        }
    }
};


// 保存到桌面测试
string desktopPath = Environment.GetFolderPath(Environment.SpecialFolder.Desktop);

string filePath = Path.Combine(desktopPath, "测试数据_旧逻辑.xlsx");
ExcelFileGenerator.SaveToFile(content, filePath, showRowIndex: true);

Console.WriteLine($"已生成文件：{filePath}");

string filePathNew = Path.Combine(desktopPath, "测试数据_新逻辑.xlsx");
// 调用示例（测试 5E-5 显示问题）
ExcelFileGenerator.ExportMultipleSheets(content, filePathNew, showRowIndex: true);

Console.WriteLine($"已生成文件：{filePathNew}");
